Revit 2024 API
ExportSheetType Enumeration
 An enumerated type listing possible Sheet type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ExportSheetType
Visual Basic
Public Enumeration ExportSheetType
Visual C++
public enum class ExportSheetType
Members
Member name | Description
Current
Visible
Select
See Also
Autodesk.Revit.DB Namespace